МПР/src/Documents/ds_ПоставкаWB/ds_ПоставкаWB.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ds_ПоставкаWB</name>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМаркетплейса</name>
    <type>
      <types>CatalogRef.ds_СкладыWB</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ds_СтатусыПоставокWB</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стикеры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Стикер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаМаркетплейса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Documents/ds_ПоставкаWB/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОткрытьФормуВыбораЗаказаПокупателя()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийДокументПоставка", Объект.Ссылка);
	ПараметрыФормы.Вставить("УжеПодобраны", ПолучитьПодобранныеЗаказы());
	
	Обработчик = Новый ОписаниеОповещения("ОповещениеПодборЗаказов", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("Документ.ds_ПоставкаWB.Форма.ФормаПодбораЗаказов", ПараметрыФормы, ЭтотОбъект, , , , Обработчик,
		Режим);

КонецПроцедуры

&НаСервере
Функция ПолучитьПодобранныеЗаказы()
	ТЗ  = Объект.Заказы.Выгрузить();
	Возврат тз.ВыгрузитьКолонку("Заказ");
КонецФункции

&НаКлиенте
Процедура ОповещениеПодборЗаказов(МассивЗаказов) Экспорт
	Если МассивЗаказов <> Неопределено Тогда
		ЗаполнитьЗаказы(МассивЗаказов);
		ЗаполнитьТовары(МассивЗаказов);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(МассивЗаказов)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МассивЗаказов.Заказ КАК Документ.ЗаказПокупателя) КАК Заказ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВременнаяТаблица КАК МассивЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ИЗ
	|	Товары КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура";

	Запрос.УстановитьПараметр("ВременнаяТаблица", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = 	Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = Выборка.Количество;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(МассивЗаказов)
	Для Каждого стр Из МассивЗаказов Цикл
		НоваяСтрока = Объект.Заказы.Добавить();
		НоваяСтрока.ДатаМаркетплейса = стр.ДатаМаркетплейса;
		НоваяСтрока.Заказ = стр.Заказ;
		НоваяСтрока.Сумма = стр.Сумма;
	КонецЦикла;
КонецПроцедуры
